
const 예시문자열 = "사과1호랑이,고니 수박BT닭";

const 자음카운터 = {'ㄱ':0, 'ㄴ':0, 'ㄷ':0, 'ㄹ':0, 'ㅁ':0,
               'ㅂ':0, 'ㅅ':0, 'ㅇ':0, 'ㅈ':0,
               'ㅊ':0, 'ㅋ':0, 'ㅌ':0, 'ㅍ':0, 'ㅎ':0}

function 한글선별기(str) {
  return str.split("").filter(el => el.charCodeAt(0) > 44032)
}

function 초종성분리기(kor) {
    const 초성군 = ['ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ',
               'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ',
               'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'];
    const 중성군 = ['ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ',
               'ㅖ', 'ㅗ', 'ㅘ', 'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ',
               'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ'];
    const 종성군 = ['', 'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ',
               'ㄷ', 'ㄹ', 'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ',
               'ㄿ', 'ㅀ', 'ㅁ', 'ㅂ', 'ㅄ', 'ㅅ', 'ㅆ',
               'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'];

    const 한글기준유니코드 = 44032;
    let kor유니코드 = kor.charCodeAt(0);

    kor유니코드 = kor유니코드 - 한글기준유니코드;

    let 초성인덱스 = parseInt(kor유니코드 / 588);
    let 중성인덱스 = parseInt((kor유니코드 - (초성인덱스 * 588)) / 28);
    let 종성인덱스 = parseInt(kor유니코드 % 28);
    
    let result = 종성군[종성인덱스] ? [초성군[초성인덱스], 종성군[종성인덱스]] : [초성군[초성인덱스]]
  
    return result;
}

let 결과배열 = 한글선별기(예시문자열).map(el => 초종성분리기(el)).flatMap(x => x);

for(let key in 자음카운터) {
  let count = 결과배열.filter(el => el === key).length;
  자음카운터[key] = count;
}

console.log(자음카운터);